; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v11 ?v13)
             (pred_4 ?v3 ?v1)
             (pred_1 ?v11 ?v1)
             (pred_10 ?v9 ?v11 )
	     (pred_12 ?v11)
             (pred_3 ?v7)
             (pred_11 ?v3)
             (pred_2 ?v1)
             (pred_9 ?v11)
             (pred_7 ?v3)
             (pred_8 ?v11)
             (pred_5 ))



(:action op_4
:parameters (?v6 ?v12 ?v2 ?v8)
:precondition (and (pred_3 ?v6) (pred_3 ?v12) (pred_11 ?v2) (pred_2 ?v8)
          (pred_6 ?v6 ?v12) (pred_4 ?v2 ?v8)
                   (pred_1 ?v12 ?v8) (pred_12 ?v6) 
                   (pred_9 ?v12) (pred_7 ?v2))
:effect (and  (pred_8 ?v12) (not (pred_9 ?v12))))


(:action op_1
:parameters (?v6 ?v5)
:precondition (and (pred_3 ?v6) (pred_3 ?v5)
               (pred_12 ?v6) (pred_6 ?v6 ?v5) (pred_8 ?v5))
:effect (and (pred_12 ?v5) (not (pred_12 ?v6))))

(:action op_3
:parameters (?v6 ?v2)
:precondition (and (pred_3 ?v6) (pred_11 ?v2) 
                  (pred_12 ?v6) (pred_10 ?v2 ?v6) (pred_5 ))
:effect (and (pred_7 ?v2)
   (not (pred_10 ?v2 ?v6)) (not (pred_5 ))))


(:action op_2
:parameters (?v6 ?v10 ?v4)
:precondition (and (pred_3 ?v6) (pred_11 ?v10) (pred_11 ?v4)
                  (pred_12 ?v6) (pred_7 ?v4) (pred_10 ?v10 ?v6))
:effect (and (pred_7 ?v10) (pred_10 ?v4 ?v6)
        (not (pred_7 ?v4)) (not (pred_10 ?v10 ?v6))))

(:action op_5
:parameters (?v6 ?v2)
:precondition (and (pred_3 ?v6) (pred_11 ?v2) 
                  (pred_12 ?v6) (pred_7 ?v2))
:effect (and (pred_5 ) (pred_10 ?v2 ?v6) (not (pred_7 ?v2)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_11 obj_01 obj_12 obj_19 obj_02 obj_13 obj_16 obj_07 obj_22 obj_21 obj_20 obj_10 obj_03 obj_18 obj_08
    obj_05 obj_14 obj_09
    obj_04 obj_15 obj_17
    )

    (:init
       (pred_5)

       (pred_3 obj_06)
       (pred_3 obj_11)
       (pred_3 obj_01)
       (pred_3 obj_12)
       (pred_3 obj_19)
       (pred_3 obj_02)
       (pred_3 obj_13)
       (pred_3 obj_16)
       (pred_3 obj_07)
       (pred_3 obj_22)
       (pred_3 obj_21)
       (pred_3 obj_20)
       (pred_3 obj_10)
       (pred_3 obj_03)
       (pred_3 obj_18)
       (pred_3 obj_08)
       (pred_2 obj_05)
       (pred_2 obj_14)
       (pred_2 obj_09)
       (pred_11 obj_04)
       (pred_11 obj_15)
       (pred_11 obj_17)

       (pred_6 obj_06 obj_19)
       (pred_6 obj_06 obj_11)
       (pred_6 obj_11 obj_02)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_01 obj_13)
       (pred_6 obj_01 obj_12)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_12 obj_16)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_19 obj_07)
       (pred_6 obj_19 obj_02)
       (pred_6 obj_19 obj_06)
       (pred_6 obj_02 obj_22)
       (pred_6 obj_02 obj_13)
       (pred_6 obj_02 obj_11)
       (pred_6 obj_02 obj_19)
       (pred_6 obj_13 obj_21)
       (pred_6 obj_13 obj_16)
       (pred_6 obj_13 obj_01)
       (pred_6 obj_13 obj_02)
       (pred_6 obj_16 obj_20)
       (pred_6 obj_16 obj_12)
       (pred_6 obj_16 obj_13)
       (pred_6 obj_07 obj_10)
       (pred_6 obj_07 obj_22)
       (pred_6 obj_07 obj_19)
       (pred_6 obj_22 obj_03)
       (pred_6 obj_22 obj_21)
       (pred_6 obj_22 obj_02)
       (pred_6 obj_22 obj_07)
       (pred_6 obj_21 obj_18)
       (pred_6 obj_21 obj_20)
       (pred_6 obj_21 obj_13)
       (pred_6 obj_21 obj_22)
       (pred_6 obj_20 obj_08)
       (pred_6 obj_20 obj_16)
       (pred_6 obj_20 obj_21)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_10 obj_07)
       (pred_6 obj_03 obj_18)
       (pred_6 obj_03 obj_22)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_18 obj_08)
       (pred_6 obj_18 obj_21)
       (pred_6 obj_18 obj_03)
       (pred_6 obj_08 obj_20)
       (pred_6 obj_08 obj_18)
       (pred_9 obj_11)
       (pred_9 obj_21)
       (pred_9 obj_16)
       (pred_1  obj_11 obj_05)
       (pred_1  obj_21 obj_14)
       (pred_1  obj_16 obj_09)
       (pred_8 obj_06)
       (pred_8 obj_01)
       (pred_8 obj_12)
       (pred_8 obj_19)
       (pred_8 obj_02)
       (pred_8 obj_13)
       (pred_8 obj_07)
       (pred_8 obj_22)
       (pred_8 obj_20)
       (pred_8 obj_10)
       (pred_8 obj_03)
       (pred_8 obj_18)
       (pred_8 obj_08)

       (pred_4  obj_04 obj_05)
       (pred_4  obj_15 obj_14)
       (pred_4  obj_17 obj_09)
       (pred_10 obj_04 obj_12)
       (pred_10 obj_15 obj_07)
       (pred_10 obj_17 obj_12)
       (pred_12 obj_12)
    )

    (:goal (and
       (pred_10 obj_17 obj_03)
    ))
(:constraints
  (always (not (pred_12 obj_22)))
)
)

; plan
1. (op_3 obj_12 obj_17)
   deleted: (pred_10 obj_17 obj_12) (pred_5)
   added: (pred_7 obj_17)
   goals met: 0 of 1
2. (op_1 obj_12 obj_01)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_01)
   goals met: 0 of 1
3. (op_1 obj_01 obj_13)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_13)
   goals met: 0 of 1
4. (op_1 obj_13 obj_02)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_02)
   goals met: 0 of 1
5. (op_1 obj_02 obj_19)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_19)
   goals met: 0 of 1
6. (op_1 obj_19 obj_07)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_07)
   goals met: 0 of 1
7. (op_1 obj_07 obj_10)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_10)
   goals met: 0 of 1
8. (op_1 obj_10 obj_03)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_03)
   goals met: 0 of 1
9. (op_5 obj_03 obj_17)
   deleted: (pred_7 obj_17)
   added: (pred_5) (pred_10 obj_17 obj_03)
   goals met: 1 of 1
